import s from "./styles.module.css";
import logo from "./logo.png";
import { Button } from "../button";

export const Header = () => {
  return (
    <header>
      <SharedHeader />
    </header>
  );
};

export const SharedHeader = ({ color }: any) => (
  <div className={s.header}>
    <div className={s.logo}>
      <img src={logo} alt='Сказкин Дом' />
    </div>
    <nav>
      {menuItems.map(({ id, href, title }) => (
        <a style={{ color }} key={id} href={href}>
          {title}
        </a>
      ))}
    </nav>
    <a href='#tickets' className={s.btn}>
      <Button name='Купить билеты' variant='primary' />
    </a>
    <a href='#tickets'>
      <svg width='36' height='36' viewBox='0 0 36 36' fill='none' xmlns='http://www.w3.org/2000/svg'>
        <rect width='36' height='36' rx='18' fill='#FF8863' />
        <path
          fill-rule='evenodd'
          clip-rule='evenodd'
          d='M23.8875 10.0463C23.8847 10.2351 23.8079 10.4181 23.6712 10.5549C23.1651 11.061 23.1534 11.8699 23.6384 12.3548C24.1267 12.8431 24.9288 12.8342 25.4354 12.3383C25.7205 12.0585 26.1518 12.0098 26.4262 12.2842L28.1302 13.9882C29.5646 15.4225 29.5311 17.7825 28.0539 19.2596L25.8246 21.489C25.5941 21.7195 25.2261 21.7248 25.0022 21.5009L23.5672 20.0659C23.2882 19.7869 22.8433 19.7934 22.5561 20.0806C22.2757 20.361 22.2624 20.8127 22.5414 21.0917L23.9764 22.5267C24.2003 22.7506 24.1949 23.1186 23.9652 23.3484L19.2596 28.054C17.7893 29.5243 15.4231 29.5653 13.9881 28.1303L12.2841 26.4263C12.0097 26.1519 12.0584 25.7206 12.3382 25.4355C12.8348 24.9282 12.8431 24.1267 12.3548 23.6385C11.8831 23.1668 11.1277 23.2047 10.608 23.7244C10.4712 23.8612 10.2881 23.938 10.0994 23.9407C9.91063 23.9434 9.72969 23.8719 9.59683 23.739L7.87619 22.0184C6.44387 20.5861 6.47829 18.2079 7.95269 16.7335L12.6515 12.0347C12.8812 11.8049 13.2493 11.7996 13.4732 12.0235L15.1739 13.7242C15.4463 13.9966 15.9047 13.9899 16.185 13.7096C16.4723 13.4223 16.472 12.9708 16.1997 12.6984L14.499 10.9977C14.2751 10.7738 14.2804 10.4058 14.5109 10.1753L16.7402 7.94592C18.2174 6.4688 20.5767 6.43464 22.0117 7.86962L23.6858 9.54375C23.8187 9.67662 23.8902 9.85756 23.8875 10.0463ZM21.2672 18.7917C21.5545 18.5045 21.5542 18.053 21.2819 17.7806L18.6245 15.1232C18.3521 14.8509 17.9006 14.8507 17.6134 15.1379C17.333 15.4183 17.3263 15.8766 17.5987 16.149L20.2561 18.8064C20.5285 19.0788 20.9869 19.0721 21.2672 18.7917Z'
          fill='white'
        />
      </svg>
    </a>
    &nbsp; &nbsp;
    {/* <div className={s.drawer}>
      <svg width='36' height='36' viewBox='0 0 36 36' fill='none' xmlns='http://www.w3.org/2000/svg'>
        <rect x='8' y='8' width='20' height='4' rx='2' fill='#FF8863' />
        <rect x='8' y='16' width='20' height='4' rx='2' fill='#FF8863' />
        <rect x='8' y='24' width='20' height='4' rx='2' fill='#FF8863' />
      </svg>
    </div> */}
  </div>
);

const menuItems = [
  { id: 0, href: "#about", title: "О Сказкином Доме" },
  { id: 1, href: "#price", title: "Цены" },
  { id: 2, href: "#birthdays", title: "Дни рождения" },
  { id: 3, href: "#shows", title: "Спектакли" },
];
